coocox/Mplib/Nuvoton/NUC123/cmsis_lib/lib/cmsis_boot/NUC123Series.h
/* GPIO PMD Bit Field Definitions */
#define GPIO_PMD_PMD15_Pos          30                                          /*!< GPIO PMD: PMD15 Position */
#define GPIO_PMD_PMD15_Msk          (0x3ul << GPIO_PMD_PMD15_Pos)               /*!< GPIO PMD: PMD15 Mask */

#define GPIO_PMD_PMD14_Pos          28                                          /*!< GPIO PMD: PMD14 Position */
#define GPIO_PMD_PMD14_Msk          (0x3ul << GPIO_PMD_PMD14_Pos)               /*!< GPIO PMD: PMD14 Mask */

#define GPIO_PMD_PMD13_Pos          26                                          /*!< GPIO PMD: PMD13 Position */
#define GPIO_PMD_PMD13_Msk          (0x3ul << GPIO_PMD_PMD13_Pos)               /*!< GPIO PMD: PMD13 Mask */

#define GPIO_PMD_PMD12_Pos          24                                          /*!< GPIO PMD: PMD12 Position */
#define GPIO_PMD_PMD12_Msk          (0x3ul << GPIO_PMD_PMD12_Pos)               /*!< GPIO PMD: PMD12 Mask */

#define GPIO_PMD_PMD11_Pos          22                                          /*!< GPIO PMD: PMD11 Position */
#define GPIO_PMD_PMD11_Msk          (0x3ul << GPIO_PMD_PMD11_Pos)               /*!< GPIO PMD: PMD11 Mask */

#define GPIO_PMD_PMD10_Pos          20                                          /*!< GPIO PMD: PMD10 Position */
#define GPIO_PMD_PMD10_Msk          (0x3ul << GPIO_PMD_PMD10_Pos)               /*!< GPIO PMD: PMD10 Mask */

#define GPIO_PMD_PMD9_Pos           18                                          /*!< GPIO PMD: PMD9 Position */
#define GPIO_PMD_PMD9_Msk           (0x3ul << GPIO_PMD_PMD9_Pos)                /*!< GPIO PMD: PMD9 Mask */

#define GPIO_PMD_PMD8_Pos           16                                          /*!< GPIO PMD: PMD8 Position */
#define GPIO_PMD_PMD8_Msk           (0x3ul << GPIO_PMD_PMD8_Pos)                /*!< GPIO PMD: PMD8 Mask */

#define GPIO_PMD_PMD7_Pos           14                                          /*!< GPIO PMD: PMD7 Position */
#define GPIO_PMD_PMD7_Msk           (0x3ul << GPIO_PMD_PMD7_Pos)                /*!< GPIO PMD: PMD7 Mask */

#define GPIO_PMD_PMD6_Pos           12                                          /*!< GPIO PMD: PMD6 Position */    
#define GPIO_PMD_PMD6_Msk           (0x3ul << GPIO_PMD_PMD6_Pos)                /*!< GPIO PMD: PMD6 Mask */

#define GPIO_PMD_PMD5_Pos           10                                          /*!< GPIO PMD: PMD5 Position */
#define GPIO_PMD_PMD5_Msk           (0x3ul << GPIO_PMD_PMD5_Pos)                /*!< GPIO PMD: PMD5 Mask */

#define GPIO_PMD_PMD4_Pos           8                                           /*!< GPIO PMD: PMD4 Position */
#define GPIO_PMD_PMD4_Msk           (0x3ul << GPIO_PMD_PMD4_Pos)                /*!< GPIO PMD: PMD4 Mask */

#define GPIO_PMD_PMD3_Pos           6                                           /*!< GPIO PMD: PMD3 Position */
#define GPIO_PMD_PMD3_Msk           (0x3ul << GPIO_PMD_PMD3_Pos)                /*!< GPIO PMD: PMD3 Mask */

#define GPIO_PMD_PMD2_Pos           4                                           /*!< GPIO PMD: PMD2 Position */
#define GPIO_PMD_PMD2_Msk           (0x3ul << GPIO_PMD_PMD2_Pos)                /*!< GPIO PMD: PMD2 Mask */

#define GPIO_PMD_PMD1_Pos           2                                           /*!< GPIO PMD: PMD1 Position */
#define GPIO_PMD_PMD1_Msk           (0x3ul << GPIO_PMD_PMD1_Pos)                /*!< GPIO PMD: PMD1 Mask */

#define GPIO_PMD_PMD0_Pos           0                                           /*!< GPIO PMD: PMD0 Position */
#define GPIO_PMD_PMD0_Msk           (0x3ul << GPIO_PMD_PMD0_Pos)                /*!< GPIO PMD: PMD0 Mask */

/* GPIO OFFD Bit Field Definitions */
#define GPIO_OFFD_OFFD15_Pos        31                                          /*!< GPIO OFFD: OFFD15 Position */
#define GPIO_OFFD_OFFD15_Msk        (1ul << GPIO_OFFD_OFFD15_Pos)               /*!< GPIO OFFD: OFFD15 Mask */

#define GPIO_OFFD_OFFD14_Pos        30                                          /*!< GPIO OFFD: OFFD14 Position */
#define GPIO_OFFD_OFFD14_Msk        (1ul << GPIO_OFFD_OFFD14_Pos)               /*!< GPIO OFFD: OFFD14 Mask */

#define GPIO_OFFD_OFFD13_Pos        29                                          /*!< GPIO OFFD: OFFD13 Position */
#define GPIO_OFFD_OFFD13_Msk        (1ul << GPIO_OFFD_OFFD13_Pos)               /*!< GPIO OFFD: OFFD13 Mask */

#define GPIO_OFFD_OFFD12_Pos        28                                          /*!< GPIO OFFD: OFFD12 Position */
#define GPIO_OFFD_OFFD12_Msk        (1ul << GPIO_OFFD_OFFD12_Pos)               /*!< GPIO OFFD: OFFD12 Mask */

#define GPIO_OFFD_OFFD11_Pos        27                                          /*!< GPIO OFFD: OFFD11 Position */
#define GPIO_OFFD_OFFD11_Msk        (1ul << GPIO_OFFD_OFFD11_Pos)               /*!< GPIO OFFD: OFFD11 Mask */

#define GPIO_OFFD_OFFD10_Pos        26                                          /*!< GPIO OFFD: OFFD10 Position */
#define GPIO_OFFD_OFFD10_Msk        (1ul << GPIO_OFFD_OFFD10_Pos)               /*!< GPIO OFFD: OFFD10 Mask */

#define GPIO_OFFD_OFFD9_Pos         25                                          /*!< GPIO OFFD: OFFD9 Position */
#define GPIO_OFFD_OFFD9_Msk         (1ul << GPIO_OFFD_OFFD9_Pos)                /*!< GPIO OFFD: OFFD9 Mask */

#define GPIO_OFFD_OFFD8_Pos         24                                          /*!< GPIO OFFD: OFFD8 Position */
#define GPIO_OFFD_OFFD8_Msk         (1ul << GPIO_OFFD_OFFD8_Pos)                /*!< GPIO OFFD: OFFD8 Mask */

#define GPIO_OFFD_OFFD7_Pos         23                                          /*!< GPIO OFFD: OFFD7 Position */
#define GPIO_OFFD_OFFD7_Msk         (1ul << GPIO_OFFD_OFFD7_Pos)                /*!< GPIO OFFD: OFFD7 Mask */

#define GPIO_OFFD_OFFD6_Pos         22                                          /*!< GPIO OFFD: OFFD6 Position */
#define GPIO_OFFD_OFFD6_Msk         (1ul << GPIO_OFFD_OFFD6_Pos)                /*!< GPIO OFFD: OFFD6 Mask */

#define GPIO_OFFD_OFFD5_Pos         21                                          /*!< GPIO OFFD: OFFD5 Position */
#define GPIO_OFFD_OFFD5_Msk         (1ul << GPIO_OFFD_OFFD5_Pos)                /*!< GPIO OFFD: OFFD5 Mask */

#define GPIO_OFFD_OFFD4_Pos         20                                          /*!< GPIO OFFD: OFFD4 Position */
#define GPIO_OFFD_OFFD4_Msk         (1ul << GPIO_OFFD_OFFD4_Pos)                /*!< GPIO OFFD: OFFD4 Mask */

#define GPIO_OFFD_OFFD3_Pos         19                                          /*!< GPIO OFFD: OFFD3 Position */
#define GPIO_OFFD_OFFD3_Msk         (1ul << GPIO_OFFD_OFFD3_Pos)                /*!< GPIO OFFD: OFFD3 Mask */

#define GPIO_OFFD_OFFD2_Pos         18                                          /*!< GPIO OFFD: OFFD2 Position */
#define GPIO_OFFD_OFFD2_Msk         (1ul << GPIO_OFFD_OFFD2_Pos)                /*!< GPIO OFFD: OFFD2 Mask */

#define GPIO_OFFD_OFFD1_Pos         17                                          /*!< GPIO OFFD: OFFD1 Position */
#define GPIO_OFFD_OFFD1_Msk         (1ul << GPIO_OFFD_OFFD1_Pos)                /*!< GPIO OFFD: OFFD1 Mask */

