coocox/Mplib/Nuvoton/NUC123/cmsis_lib/lib/cmsis_boot/NUC123Series.h
#define GPIO_OFFD_OFFD0_Pos         16                                          /*!< GPIO OFFD: OFFD0 Position */
#define GPIO_OFFD_OFFD0_Msk         (1ul << GPIO_OFFD_OFFD0_Pos)                /*!< GPIO OFFD: OFFD0 Mask */

/* GPIO DOUT Bit Field Definitions */                                           
#define GPIO_DOUT_DOUT_Pos          0                                           /*!< GPIO DOUT: DOUT Position */
#define GPIO_DOUT_DOUT_Msk          (0xFFFFul << GPIO_DOUT_DOUT_Pos)            /*!< GPIO DOUT: DOUT Mask */

/* GPIO DMASK Bit Field Definitions */
#define GPIO_DMASK_DMASK15_Pos      15                                          /*!< GPIO DMASK: DMASK15 Position */
#define GPIO_DMASK_DMASK15_Msk      (1ul << GPIO_DMASK_DMASK15_Pos)             /*!< GPIO DMASK: DMASK15 Mask */

#define GPIO_DMASK_DMASK14_Pos      14                                          /*!< GPIO DMASK: DMASK14 Position */
#define GPIO_DMASK_DMASK14_Msk      (1ul << GPIO_DMASK_DMASK14_Pos)             /*!< GPIO DMASK: DMASK14 Mask */

#define GPIO_DMASK_DMASK13_Pos      13                                          /*!< GPIO DMASK: DMASK13 Position */
#define GPIO_DMASK_DMASK13_Msk      (1ul << GPIO_DMASK_DMASK13_Pos)             /*!< GPIO DMASK: DMASK13 Mask */

#define GPIO_DMASK_DMASK12_Pos      12                                          /*!< GPIO DMASK: DMASK12 Position */
#define GPIO_DMASK_DMASK12_Msk      (1ul << GPIO_DMASK_DMASK12_Pos)             /*!< GPIO DMASK: DMASK12 Mask */

#define GPIO_DMASK_DMASK11_Pos      11                                          /*!< GPIO DMASK: DMASK11 Position */
#define GPIO_DMASK_DMASK11_Msk      (1ul << GPIO_DMASK_DMASK11_Pos)             /*!< GPIO DMASK: DMASK11 Mask */

#define GPIO_DMASK_DMASK10_Pos      10                                          /*!< GPIO DMASK: DMASK10 Position */
#define GPIO_DMASK_DMASK10_Msk      (1ul << GPIO_DMASK_DMASK10_Pos)             /*!< GPIO DMASK: DMASK10 Mask */

#define GPIO_DMASK_DMASK9_Pos       9                                           /*!< GPIO DMASK: DMASK9 Position */
#define GPIO_DMASK_DMASK9_Msk       (1ul << GPIO_DMASK_DMASK9_Pos)              /*!< GPIO DMASK: DMASK9 Mask */

#define GPIO_DMASK_DMASK8_Pos       8                                           /*!< GPIO DMASK: DMASK8 Position */
#define GPIO_DMASK_DMASK8_Msk       (1ul << GPIO_DMASK_DMASK8_Pos)              /*!< GPIO DMASK: DMASK8 Mask */

#define GPIO_DMASK_DMASK7_Pos       7                                           /*!< GPIO DMASK: DMASK7 Position */
#define GPIO_DMASK_DMASK7_Msk       (1ul << GPIO_DMASK_DMASK7_Pos)              /*!< GPIO DMASK: DMASK7 Mask */

#define GPIO_DMASK_DMASK6_Pos       6                                           /*!< GPIO DMASK: DMASK6 Position */
#define GPIO_DMASK_DMASK6_Msk       (1ul << GPIO_DMASK_DMASK6_Pos)              /*!< GPIO DMASK: DMASK6 Mask */

#define GPIO_DMASK_DMASK5_Pos       5                                           /*!< GPIO DMASK: DMASK5 Position */
#define GPIO_DMASK_DMASK5_Msk       (1ul << GPIO_DMASK_DMASK5_Pos)              /*!< GPIO DMASK: DMASK5 Mask */

#define GPIO_DMASK_DMASK4_Pos       4                                           /*!< GPIO DMASK: DMASK4 Position */
#define GPIO_DMASK_DMASK4_Msk       (1ul << GPIO_DMASK_DMASK4_Pos)              /*!< GPIO DMASK: DMASK4 Mask */

#define GPIO_DMASK_DMASK3_Pos       3                                           /*!< GPIO DMASK: DMASK3 Position */
#define GPIO_DMASK_DMASK3_Msk       (1ul << GPIO_DMASK_DMASK3_Pos)              /*!< GPIO DMASK: DMASK3 Mask */

#define GPIO_DMASK_DMASK2_Pos       2                                           /*!< GPIO DMASK: DMASK2 Position */
#define GPIO_DMASK_DMASK2_Msk       (1ul << GPIO_DMASK_DMASK2_Pos)              /*!< GPIO DMASK: DMASK2 Mask */

#define GPIO_DMASK_DMASK1_Pos       1                                           /*!< GPIO DMASK: DMASK1 Position */
#define GPIO_DMASK_DMASK1_Msk       (1ul << GPIO_DMASK_DMASK1_Pos)              /*!< GPIO DMASK: DMASK1 Mask */

#define GPIO_DMASK_DMASK0_Pos       0                                           /*!< GPIO DMASK: DMASK0 Position */
#define GPIO_DMASK_DMASK0_Msk       (1ul << GPIO_DMASK_DMASK0_Pos)              /*!< GPIO DMASK: DMASK0 Mask */

/* GPIO PIN Bit Field Definitions */
#define GPIO_PIN_PIN_Pos            0                                           /*!< GPIO PIN: PIN Position */   
#define GPIO_PIN_PIN_Msk            (0xFFFFul << GPIO_PIN_PIN_Pos)              /*!< GPIO PIN: PIN Mask */

/* GPIO DBEN Bit Field Definitions */
#define GPIO_DBEN_DBEN15_Pos        15                                          /*!< GPIO DBEN: DBEN15 Position */
#define GPIO_DBEN_DBEN15_Msk        (1ul << GPIO_DBEN_DBEN15_Pos)               /*!< GPIO DBEN: DBEN15 Mask */

#define GPIO_DBEN_DBEN14_Pos        14                                          /*!< GPIO DBEN: DBEN14 Position */
#define GPIO_DBEN_DBEN14_Msk        (1ul << GPIO_DBEN_DBEN14_Pos)               /*!< GPIO DBEN: DBEN14 Mask */

#define GPIO_DBEN_DBEN13_Pos        13                                          /*!< GPIO DBEN: DBEN13 Position */
#define GPIO_DBEN_DBEN13_Msk        (1ul << GPIO_DBEN_DBEN13_Pos)               /*!< GPIO DBEN: DBEN13 Mask */

#define GPIO_DBEN_DBEN12_Pos        12                                          /*!< GPIO DBEN: DBEN12 Position */
#define GPIO_DBEN_DBEN12_Msk        (1ul << GPIO_DBEN_DBEN12_Pos)               /*!< GPIO DBEN: DBEN12 Mask */

#define GPIO_DBEN_DBEN11_Pos        11                                          /*!< GPIO DBEN: DBEN11 Position */
#define GPIO_DBEN_DBEN11_Msk        (1ul << GPIO_DBEN_DBEN11_Pos)               /*!< GPIO DBEN: DBEN11 Mask */

#define GPIO_DBEN_DBEN10_Pos        10                                          /*!< GPIO DBEN: DBEN10 Position */
#define GPIO_DBEN_DBEN10_Msk        (1ul << GPIO_DBEN_DBEN10_Pos)               /*!< GPIO DBEN: DBEN10 Mask */

#define GPIO_DBEN_DBEN9_Pos         9                                           /*!< GPIO DBEN: DBEN9 Position */
#define GPIO_DBEN_DBEN9_Msk         (1ul << GPIO_DBEN_DBEN9_Pos)                /*!< GPIO DBEN: DBEN9 Mask */

#define GPIO_DBEN_DBEN8_Pos         8                                           /*!< GPIO DBEN: DBEN8 Position */
#define GPIO_DBEN_DBEN8_Msk         (1ul << GPIO_DBEN_DBEN8_Pos)                /*!< GPIO DBEN: DBEN8 Mask */

