coocox/Mplib/Nuvoton/NUC123/cmsis_lib/lib/cmsis_boot/NUC123Series.h
#define GPIO_DBEN_DBEN7_Pos         7                                           /*!< GPIO DBEN: DBEN7 Position */
#define GPIO_DBEN_DBEN7_Msk         (1ul << GPIO_DBEN_DBEN7_Pos)                /*!< GPIO DBEN: DBEN7 Mask */

#define GPIO_DBEN_DBEN6_Pos         6                                           /*!< GPIO DBEN: DBEN6 Position */
#define GPIO_DBEN_DBEN6_Msk         (1ul << GPIO_DBEN_DBEN6_Pos)                /*!< GPIO DBEN: DBEN6 Mask */

#define GPIO_DBEN_DBEN5_Pos         5                                           /*!< GPIO DBEN: DBEN5 Position */
#define GPIO_DBEN_DBEN5_Msk         (1ul << GPIO_DBEN_DBEN5_Pos)                /*!< GPIO DBEN: DBEN5 Mask */

#define GPIO_DBEN_DBEN4_Pos         4                                           /*!< GPIO DBEN: DBEN4 Position */
#define GPIO_DBEN_DBEN4_Msk         (1ul << GPIO_DBEN_DBEN4_Pos)                /*!< GPIO DBEN: DBEN4 Mask */

#define GPIO_DBEN_DBEN3_Pos         3                                           /*!< GPIO DBEN: DBEN3 Position */
#define GPIO_DBEN_DBEN3_Msk         (1ul << GPIO_DBEN_DBEN3_Pos)                /*!< GPIO DBEN: DBEN3 Mask */

#define GPIO_DBEN_DBEN2_Pos         2                                           /*!< GPIO DBEN: DBEN2 Position */
#define GPIO_DBEN_DBEN2_Msk         (1ul << GPIO_DBEN_DBEN2_Pos)                /*!< GPIO DBEN: DBEN2 Mask */

#define GPIO_DBEN_DBEN1_Pos         1                                           /*!< GPIO DBEN: DBEN1 Position */
#define GPIO_DBEN_DBEN1_Msk         (1ul << GPIO_DBEN_DBEN1_Pos)                /*!< GPIO DBEN: DBEN1 Mask */

#define GPIO_DBEN_DBEN0_Pos         0                                           /*!< GPIO DBEN: DBEN0 Position */
#define GPIO_DBEN_DBEN0_Msk         (1ul << GPIO_DBEN_DBEN0_Pos)                /*!< GPIO DBEN: DBEN0 Mask */

/* GPIO IMD Bit Field Definitions */
#define GPIO_IMD_IMD15_Pos          15                                          /*!< GPIO IMD: IMD15 Position */
#define GPIO_IMD_IMD15_Msk          (1ul << GPIO_IMD_IMD15_Pos)                 /*!< GPIO IMD: IMD15 Mask */

#define GPIO_IMD_IMD14_Pos          14                                          /*!< GPIO IMD: IMD14 Position */
#define GPIO_IMD_IMD14_Msk          (1ul << GPIO_IMD_IMD14_Pos)                 /*!< GPIO IMD: IMD14 Mask */

#define GPIO_IMD_IMD13_Pos          13                                          /*!< GPIO IMD: IMD13 Position */
#define GPIO_IMD_IMD13_Msk          (1ul << GPIO_IMD_IMD13_Pos)                 /*!< GPIO IMD: IMD13 Mask */

#define GPIO_IMD_IMD12_Pos          12                                          /*!< GPIO IMD: IMD12 Position */
#define GPIO_IMD_IMD12_Msk          (1ul << GPIO_IMD_IMD12_Pos)                 /*!< GPIO IMD: IMD12 Mask */

#define GPIO_IMD_IMD11_Pos          11                                          /*!< GPIO IMD: IMD11 Position */
#define GPIO_IMD_IMD11_Msk          (1ul << GPIO_IMD_IMD11_Pos)                 /*!< GPIO IMD: IMD11 Mask */

#define GPIO_IMD_IMD10_Pos          10                                          /*!< GPIO IMD: IMD10 Position */
#define GPIO_IMD_IMD10_Msk          (1ul << GPIO_IMD_IMD10_Pos)                 /*!< GPIO IMD: IMD10 Mask */

#define GPIO_IMD_IMD9_Pos           9                                           /*!< GPIO IMD: IMD9 Position */
#define GPIO_IMD_IMD9_Msk           (1ul << GPIO_IMD_IMD9_Pos)                  /*!< GPIO IMD: IMD9 Mask */

#define GPIO_IMD_IMD8_Pos           8                                           /*!< GPIO IMD: IMD8 Position */
#define GPIO_IMD_IMD8_Msk           (1ul << GPIO_IMD_IMD8_Pos)                  /*!< GPIO IMD: IMD8 Mask */

#define GPIO_IMD_IMD7_Pos           7                                           /*!< GPIO IMD: IMD7 Position */
#define GPIO_IMD_IMD7_Msk           (1ul << GPIO_IMD_IMD7_Pos)                  /*!< GPIO IMD: IMD7 Mask */

#define GPIO_IMD_IMD6_Pos           6                                           /*!< GPIO IMD: IMD6 Position */
#define GPIO_IMD_IMD6_Msk           (1ul << GPIO_IMD_IMD6_Pos)                  /*!< GPIO IMD: IMD6 Mask */

#define GPIO_IMD_IMD5_Pos           5                                           /*!< GPIO IMD: IMD5 Position */
#define GPIO_IMD_IMD5_Msk           (1ul << GPIO_IMD_IMD5_Pos)                  /*!< GPIO IMD: IMD5 Mask */

#define GPIO_IMD_IMD4_Pos           4                                           /*!< GPIO IMD: IMD4 Position */
#define GPIO_IMD_IMD4_Msk           (1ul << GPIO_IMD_IMD4_Pos)                  /*!< GPIO IMD: IMD4 Mask */

#define GPIO_IMD_IMD3_Pos           3                                           /*!< GPIO IMD: IMD3 Position */
#define GPIO_IMD_IMD3_Msk           (1ul << GPIO_IMD_IMD3_Pos)                  /*!< GPIO IMD: IMD3 Mask */

#define GPIO_IMD_IMD2_Pos           2                                           /*!< GPIO IMD: IMD2 Position */
#define GPIO_IMD_IMD2_Msk           (1ul << GPIO_IMD_IMD2_Pos)                  /*!< GPIO IMD: IMD2 Mask */

#define GPIO_IMD_IMD1_Pos           1                                           /*!< GPIO IMD: IMD1 Position */
#define GPIO_IMD_IMD1_Msk           (1ul << GPIO_IMD_IMD1_Pos)                  /*!< GPIO IMD: IMD1 Mask */

#define GPIO_IMD_IMD0_Pos           0                                           /*!< GPIO IMD: IMD0 Position */
#define GPIO_IMD_IMD0_Msk           (1ul << GPIO_IMD_IMD0_Pos)                  /*!< GPIO IMD: IMD0 Mask */

/* GPIO IEN Bit Field Definitions */
#define GPIO_IEN_IR_EN15_Pos        31                                          /*!< GPIO IEN: IR_EN15 Position */
#define GPIO_IEN_IR_EN15_Msk        (1ul << GPIO_IEN_IR_EN15_Pos)               /*!< GPIO IEN: IR_EN15 Mask */

#define GPIO_IEN_IR_EN14_Pos        30                                          /*!< GPIO IEN: IR_EN14 Position */
#define GPIO_IEN_IR_EN14_Msk        (1ul << GPIO_IEN_IR_EN14_Pos)               /*!< GPIO IEN: IR_EN14 Mask */

#define GPIO_IEN_IR_EN13_Pos        29                                          /*!< GPIO IEN: IR_EN13 Position */
#define GPIO_IEN_IR_EN13_Msk        (1ul << GPIO_IEN_IR_EN13_Pos)               /*!< GPIO IEN: IR_EN13 Mask */

#define GPIO_IEN_IR_EN12_Pos        28                                          /*!< GPIO IEN: IR_EN12 Position */
#define GPIO_IEN_IR_EN12_Msk        (1ul << GPIO_IEN_IR_EN12_Pos)               /*!< GPIO IEN: IR_EN12 Mask */

#define GPIO_IEN_IR_EN11_Pos        27                                          /*!< GPIO IEN: IR_EN11 Position */
#define GPIO_IEN_IR_EN11_Msk        (1ul << GPIO_IEN_IR_EN11_Pos)               /*!< GPIO IEN: IR_EN11 Mask */

#define GPIO_IEN_IR_EN10_Pos        26                                          /*!< GPIO IEN: IR_EN10 Position */
#define GPIO_IEN_IR_EN10_Msk        (1ul << GPIO_IEN_IR_EN10_Pos)               /*!< GPIO IEN: IR_EN10 Mask */

#define GPIO_IEN_IR_EN9_Pos         25                                          /*!< GPIO IEN: IR_EN9 Position */
#define GPIO_IEN_IR_EN9_Msk         (1ul << GPIO_IEN_IR_EN9_Pos)                /*!< GPIO IEN: IR_EN9 Mask */

#define GPIO_IEN_IR_EN8_Pos         24                                          /*!< GPIO IEN: IR_EN8 Position */
#define GPIO_IEN_IR_EN8_Msk         (1ul << GPIO_IEN_IR_EN8_Pos)                /*!< GPIO IEN: IR_EN8 Mask */

#define GPIO_IEN_IR_EN7_Pos         23                                          /*!< GPIO IEN: IR_EN7 Position */
#define GPIO_IEN_IR_EN7_Msk         (1ul << GPIO_IEN_IR_EN7_Pos)                /*!< GPIO IEN: IR_EN7 Mask */

#define GPIO_IEN_IR_EN6_Pos         22                                          /*!< GPIO IEN: IR_EN6 Position */
#define GPIO_IEN_IR_EN6_Msk         (1ul << GPIO_IEN_IR_EN6_Pos)                /*!< GPIO IEN: IR_EN6 Mask */

#define GPIO_IEN_IR_EN5_Pos         21                                          /*!< GPIO IEN: IR_EN5 Position */
#define GPIO_IEN_IR_EN5_Msk         (1ul << GPIO_IEN_IR_EN5_Pos)                /*!< GPIO IEN: IR_EN5 Mask */

