coocox/Mplib/Nuvoton/NUC123/cmsis_lib/lib/cmsis_boot/NUC123Series.h
#define ADC_ADCR_TRGS_Pos       4                                 /*!< ADC ADCR: TRGS Position */
#define ADC_ADCR_TRGS_Msk       (3ul << ADC_ADCR_TRGS_Pos)        /*!< ADC ADCR: TRGS Mask */

#define ADC_ADCR_ADMD_Pos       2                                 /*!< ADC ADCR: ADMD Position */
#define ADC_ADCR_ADMD_Msk       (3ul << ADC_ADCR_ADMD_Pos)        /*!< ADC ADCR: ADMD Mask */

#define ADC_ADCR_ADIE_Pos       1                                 /*!< ADC ADCR: ADIE Position */
#define ADC_ADCR_ADIE_Msk       (1ul << ADC_ADCR_ADIE_Pos)        /*!< ADC ADCR: ADIE Mask */

#define ADC_ADCR_ADEN_Pos       0                                 /*!< ADC ADCR: ADEN Position */
#define ADC_ADCR_ADEN_Msk       (1ul << ADC_ADCR_ADEN_Pos)        /*!< ADC ADCR: ADEN Mask */

/* ADCHER Bit Field Definitions */
#define ADC_CHER_PRESEL_Pos   8                                 /*!< ADC ADCHER: PRESEL Position */
#define ADC_CHER_PRESEL_Msk   (3ul << ADC_CHER_PRESEL_Pos)    /*!< ADC ADCHER: PRESEL Mask */

#define ADC_CHER_CHEN7_Pos    7                                 /*!< ADC ADCHER: CHEN7 Position */
#define ADC_CHER_CHEN7_Msk    (1ul << ADC_CHER_CHEN7_Pos)     /*!< ADC ADCHER: CHEN7 Mask */

#define ADC_CHER_CHEN6_Pos    6                                 /*!< ADC ADCHER: CHEN6 Position */
#define ADC_CHER_CHEN6_Msk    (1ul << ADC_CHER_CHEN6_Pos)     /*!< ADC ADCHER: CHEN6 Mask */

#define ADC_CHER_CHEN5_Pos    5                                 /*!< ADC ADCHER: CHEN5 Position */
#define ADC_CHER_CHEN5_Msk    (1ul << ADC_CHER_CHEN5_Pos)     /*!< ADC ADCHER: CHEN5 Mask */

#define ADC_CHER_CHEN4_Pos    4                                 /*!< ADC ADCHER: CHEN4 Position */
#define ADC_CHER_CHEN4_Msk    (1ul << ADC_CHER_CHEN4_Pos)     /*!< ADC ADCHER: CHEN4 Mask */

#define ADC_CHER_CHEN3_Pos    3                                 /*!< ADC ADCHER: CHEN3 Position */
#define ADC_CHER_CHEN3_Msk    (1ul << ADC_CHER_CHEN3_Pos)     /*!< ADC ADCHER: CHEN3 Mask */

#define ADC_CHER_CHEN2_Pos    2                                 /*!< ADC ADCHER: CHEN2 Position */
#define ADC_CHER_CHEN2_Msk    (1ul << ADC_CHER_CHEN2_Pos)     /*!< ADC ADCHER: CHEN2 Mask */

#define ADC_CHER_CHEN1_Pos    1                                 /*!< ADC ADCHER: CHEN1 Position */
#define ADC_CHER_CHEN1_Msk    (1ul << ADC_CHER_CHEN1_Pos)     /*!< ADC ADCHER: CHEN1 Mask */

#define ADC_CHER_CHEN0_Pos    0                                 /*!< ADC ADCHER: CHEN0 Position */
#define ADC_CHER_CHEN0_Msk    (1ul << ADC_CHER_CHEN0_Pos)     /*!< ADC ADCHER: CHEN0 Mask */

/* ADCMPR Bit Field Definitions */
#define ADC_CMPR_CMPD_Pos        16                                    /*!< ADC ADCMPR: CMPD Position */
#define ADC_CMPR_CMPD_Msk        (0xFFFul << ADC_CMPR_CMPD_Pos)      /*!< ADC ADCMPR: CMPD Mask */

#define ADC_CMPR_CMPMATCNT_Pos   8                                     /*!< ADC ADCMPR: CMPMATCNT Position */
#define ADC_CMPR_CMPMATCNT_Msk   (0xFul << ADC_CMPR_CMPMATCNT_Pos)   /*!< ADC ADCMPR: CMPMATCNT Mask */

#define ADC_CMPR_CMPCH_Pos       3                                     /*!< ADC ADCMPR: CMPCH Position */
#define ADC_CMPR_CMPCH_Msk       (7ul << ADC_CMPR_CMPCH_Pos)         /*!< ADC ADCMPR: CMPCH Mask */

#define ADC_CMPR_CMPCOND_Pos     2                                     /*!< ADC ADCMPR: CMPCOND Position */
#define ADC_CMPR_CMPCOND_Msk     (1ul << ADC_CMPR_CMPCOND_Pos)       /*!< ADC ADCMPR: CMPCOND Mask */

#define ADC_CMPR_CMPIE_Pos       1                                     /*!< ADC ADCMPR: CMPIE Position */
#define ADC_CMPR_CMPIE_Msk       (1ul << ADC_CMPR_CMPIE_Pos)         /*!< ADC ADCMPR: CMPIE Mask */

#define ADC_CMPR_CMPEN_Pos       0                                     /*!< ADC ADCMPR: CMPEN Position */
#define ADC_CMPR_CMPEN_Msk       (1ul << ADC_CMPR_CMPEN_Pos)         /*!< ADC ADCMPR: CMPEN Mask */

/* ADSR Bit Field Definitions */
#define ADC_ADSR_OVERRUN_Pos       16                                    /*!< ADC ADSR: OVERRUN Position */
#define ADC_ADSR_OVERRUN_Msk       (0xFFul << ADC_ADSR_OVERRUN_Pos)      /*!< ADC ADSR: OVERRUN Mask */

#define ADC_ADSR_VALID_Pos         8                                     /*!< ADC ADSR: VALID Position */
#define ADC_ADSR_VALID_Msk         (0xFFul << ADC_ADSR_VALID_Pos)        /*!< ADC ADSR: VALID Mask */

#define ADC_ADSR_CHANNEL_Pos       4                                     /*!< ADC ADSR: CHANNEL Position */
#define ADC_ADSR_CHANNEL_Msk       (7ul << ADC_ADSR_CHANNEL_Pos)         /*!< ADC ADSR: CHANNEL Mask */

#define ADC_ADSR_BUSY_Pos          3                                     /*!< ADC ADSR: BUSY Position */
#define ADC_ADSR_BUSY_Msk          (1ul << ADC_ADSR_BUSY_Pos)            /*!< ADC ADSR: BUSY Mask */

#define ADC_ADSR_CMPF1_Pos         2                                     /*!< ADC ADSR: CMPF1 Position */
#define ADC_ADSR_CMPF1_Msk         (1ul << ADC_ADSR_CMPF1_Pos)           /*!< ADC ADSR: CMPF1 Mask */

#define ADC_ADSR_CMPF0_Pos         1                                     /*!< ADC ADSR: CMPF0 Position */
#define ADC_ADSR_CMPF0_Msk         (1ul << ADC_ADSR_CMPF0_Pos)           /*!< ADC ADSR: CMPF0 Mask */

#define ADC_ADSR_ADF_Pos           0                                     /*!< ADC ADSR: ADF Position */
#define ADC_ADSR_ADF_Msk           (1ul << ADC_ADSR_ADF_Pos)             /*!< ADC ADSR: ADF Mask */

/* ADPDMA Bit Field Definitions */
#define ADC_PDMA_AD_PDMA_Pos     0                                     /*!< ADC ADPDMA: AD_PDMA Position */
#define ADC_PDMA_AD_PDMA_Msk     (0x3FFul << ADC_ADPDMA_AD_PDMA_Pos) /*!< ADC ADPDMA: AD_PDMA Mask */

/*@}*/ /* end of group NUC123_ADC */



/*---------------------------- Clock Controller ------------------------------*/

/** @addtogroup NUC123_CLK NUC123_CLK
  Memory Mapped Structure for NUC123 Series System Clock Controller
  @{
 */
typedef struct
{
    __IO uint32_t PWRCON;	        /*!< Offset: 0x00  System Power-down Control Register        */           
    __IO uint32_t AHBCLK;      	  /*!< Offset: 0x04  AHB Devices Clock Enable Control Register */     
    __IO uint32_t APBCLK;        	/*!< Offset: 0x08  APB Devices Clock Enable Control Register */   
    __IO uint32_t CLKSTATUS;   	  /*!< Offset: 0x0C  Clock status monitor Register             */     
    __IO uint32_t CLKSEL0;       	/*!< Offset: 0x10  Clock Source Select Control Register 0    */   
    __IO uint32_t CLKSEL1;        /*!< Offset: 0x14  Clock Source Select Control Register 1    */  
    __IO uint32_t CLKDIV;        	/*!< Offset: 0x18  Clock Divider Number Register             */   
    __IO uint32_t CLKSEL2;       	/*!< Offset: 0x1C  Clock Source Select Control Register 2    */    
    __IO uint32_t PLLCON;         /*!< Offset: 0x20  PLL Control Register                      */
    __IO uint32_t FRQDIV;         /*!< Offset: 0x24  Frequency Divider Control Register        */  
    __IO uint32_t RESERVE;
    __IO uint32_t APBDIV;         /*!< Offset: 0x2C  APB Divider Control Register              */   
} CLK_T;

/* CLK PWRCON Bit Field Definitions */
#define CLK_PWRCON_PD_WAIT_CPU_Pos           8                                    /*!< CLK PWRCON: PD_WAIT_CPU Position */
#define CLK_PWRCON_PD_WAIT_CPU_Msk           (1ul << CLK_PWRCON_PD_WAIT_CPU_Pos)  /*!< CLK PWRCON: PD_WAIT_CPU Mask */

#define CLK_PWRCON_PWR_DOWN_EN_Pos           7                                    /*!< CLK PWRCON: PWR_DOWN_EN Position */
#define CLK_PWRCON_PWR_DOWN_EN_Msk           (1ul << CLK_PWRCON_PWR_DOWN_EN_Pos)  /*!< CLK PWRCON: PWR_DOWN_EN Mask */

#define CLK_PWRCON_PD_WU_STS_Pos             6                                    /*!< CLK PWRCON: PD_WU_STS Position */
#define CLK_PWRCON_PD_WU_STS_Msk             (1ul << CLK_PWRCON_PD_WU_STS_Pos)    /*!< CLK PWRCON: PD_WU_STS Mask */

#define CLK_PWRCON_PD_WU_INT_EN_Pos          5                                    /*!< CLK PWRCON: PD_WU_INT_EN Position */
#define CLK_PWRCON_PD_WU_INT_EN_Msk          (1ul << CLK_PWRCON_PD_WU_INT_EN_Pos) /*!< CLK PWRCON: PD_WU_INT_EN Mask */

#define CLK_PWRCON_PD_WU_DLY_Pos             4                                    /*!< CLK PWRCON: PD_WU_DLY Position */
#define CLK_PWRCON_PD_WU_DLY_Msk             (1ul << CLK_PWRCON_PD_WU_DLY_Pos)    /*!< CLK PWRCON: PD_WU_DLY Mask */

#define CLK_PWRCON_LIRC_EN_Pos             3                                    /*!< CLK PWRCON: IRC10K_EN Position */
#define CLK_PWRCON_LIRC_EN_Msk             (1ul << CLK_PWRCON_LIRC_EN_Pos)    /*!< CLK PWRCON: IRC10K_EN Mask */

